app/controllers/customer/addresses_controller.rb

  def index
    @address = Address.new
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

  def create
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    if @address.save
      redirect_to addresses_path
    else
      @addresses = Address.all
---
INSERT INTO "addresses" ("customer_id", "postal_code", "address", "ship_to_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 5], ["postal_code", "000000"], ["address", "aaaaaa"], ["ship_to_name", "aaaaaa"], ["created_at", "2022-03-14 01:29:09.618455"], ["updated_at", "2022-03-14 01:29:09.618455"]]
SELECT "addresses".* FROM "addresses"

  def update
    @address = Address.find(params[:id])
    if @address.update(address_params)
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "postal_code" = ?, "address" = ?, "ship_to_name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["postal_code", "000000ssss"], ["address", "aaaaaaaassss"], ["ship_to_name", "aaaaaaaaaassss"], ["updated_at", "2022-03-14 01:29:29.134274"], ["id", 3]]

  def destroy
    @address = Address.find(params[:id])
    @address.destroy
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]