app/controllers/customer/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items"
---
  def index
    @cart_items = CartItem.all

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 10], ["updated_at", "2022-03-12 15:45:21.724068"], ["id", 9]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    if @cart_item.update(cart_item_params)

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" = ? LIMIT ?  [["item_id", 3], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 8], ["updated_at", "2022-03-12 14:56:09.514596"], ["id", 5]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 2], ["customer_id", 5], ["amount", 6], ["created_at", "2022-03-12 15:45:38.525852"], ["updated_at", "2022-03-12 15:45:38.525852"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def create
    if CartItem.find_by(item_id: cart_item_params[:item_id])
      @cart_item = CartItem.find_by(item_id: cart_item_params[:item_id])
      new_amount = @cart_item.amount + cart_item_params[:amount].to_i
      @cart_item.update(amount: new_amount)
      redirect_to cart_items_path
    else
      @cart_item = CartItem.new(cart_item_params)
      @cart_item.customer_id = current_customer.id
      if @cart_item.save
        redirect_to cart_items_path
      else
        @item = Item.find(cart_item_params[:item_id])

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 9]]
---
  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 10]]
---
  def destroy_all
    current_customer.cart_items.destroy_all