app/controllers/customer/customers_controller.rb

  def show
    @customer = Customer.find(current_customer.id)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @customer = Customer.find(current_customer.id)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @customer = Customer.find(current_customer.id)
    if @customer.update(customer_params)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "customers" SET "family_name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["family_name", "cccaaa"], ["updated_at", "2022-02-26 11:07:04.642552"], ["id", 3]]

  def destroy
    @customer = current_customer
    @customer.update(is_unsubscrib: true)
---
UPDATE "customers" SET "is_unsubscrib" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_unsubscrib", 1], ["updated_at", "2022-02-26 11:06:24.787785"], ["id", 2]]