app/controllers/customer/sessions_controller.rb

  def customer_state
    @customer = Customer.find_by(email: params[:customer][:email])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "aaa@aaa"], ["LIMIT", 1]]