app/controllers/admin/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    @genre = Genre.new
    @genres = Genre.all

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "プリン"], ["created_at", "2022-03-11 11:15:17.062579"], ["updated_at", "2022-03-11 11:15:17.062579"]]
SELECT "genres".* FROM "genres"
---
  def create
    @genre = Genre.new(genre_params)
    if @genre.save
      redirect_to admin_genres_path, notice: 'ジャンルを登録しました'
    else
      @genres = Genre.all

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "プリン"], ["updated_at", "2022-03-10 11:13:48.567044"], ["id", 1]]
---
  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)