app/controllers/admin/items_controller.rb

  def index
    if params[:keyword]
      @items = Item.search(params[:keyword])
---
SELECT "items".* FROM "items"

  def new
    @item = Item.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @item = Item.new(item_params)
    @genres = Genre.all
    if @item.save
---
SELECT "genres".* FROM "genres"
INSERT INTO "items" ("name", "introduction", "tax_excluded_price", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aaa"], ["introduction", "aaa"], ["tax_excluded_price", 100], ["genre_id", 42], ["created_at", "2022-03-12 18:36:08.532898"], ["updated_at", "2022-03-12 18:36:08.532898"]]