app/views/customer/items/index.html.erb

SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items"
---
<h2>商品一覧</h2>
<p><%= "(全#{Item.count}件)" %></p>